---
kind: property
id: P:Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUApplication
source: html/f0e34b1e-30d2-60d9-fc06-34a4f497a303.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUApplication Property

The property labeled "Finish" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public static string MasonryCMUApplication { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUApplicationType".